GopalSaraf/Practicals/PSDL/include/proc/pic18f66j93.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_SEG0_POSN                          equ 0000h
PORTD_SEG0_POSITION                      equ 0000h
PORTD_SEG0_SIZE                          equ 0001h
PORTD_SEG0_LENGTH                        equ 0001h
PORTD_SEG0_MASK                          equ 0001h
PORTD_SEG1_POSN                          equ 0001h
PORTD_SEG1_POSITION                      equ 0001h
PORTD_SEG1_SIZE                          equ 0001h
PORTD_SEG1_LENGTH                        equ 0001h
PORTD_SEG1_MASK                          equ 0002h
PORTD_SEG2_POSN                          equ 0002h
PORTD_SEG2_POSITION                      equ 0002h
PORTD_SEG2_SIZE                          equ 0001h
PORTD_SEG2_LENGTH                        equ 0001h
PORTD_SEG2_MASK                          equ 0004h
PORTD_SEG3_POSN                          equ 0003h
PORTD_SEG3_POSITION                      equ 0003h
PORTD_SEG3_SIZE                          equ 0001h
PORTD_SEG3_LENGTH                        equ 0001h
PORTD_SEG3_MASK                          equ 0008h
PORTD_SEG4_POSN                          equ 0004h
PORTD_SEG4_POSITION                      equ 0004h
PORTD_SEG4_SIZE                          equ 0001h
PORTD_SEG4_LENGTH                        equ 0001h
PORTD_SEG4_MASK                          equ 0010h
PORTD_SEG5_POSN                          equ 0005h
PORTD_SEG5_POSITION                      equ 0005h
PORTD_SEG5_SIZE                          equ 0001h
PORTD_SEG5_LENGTH                        equ 0001h
PORTD_SEG5_MASK                          equ 0020h
PORTD_SEG6_POSN                          equ 0006h
PORTD_SEG6_POSITION                      equ 0006h
PORTD_SEG6_SIZE                          equ 0001h
PORTD_SEG6_LENGTH                        equ 0001h
PORTD_SEG6_MASK                          equ 0040h
PORTD_SEG7_POSN                          equ 0007h
PORTD_SEG7_POSITION                      equ 0007h
PORTD_SEG7_SIZE                          equ 0001h
PORTD_SEG7_LENGTH                        equ 0001h
PORTD_SEG7_MASK                          equ 0080h
PORTD_CTPLS_POSN                         equ 0000h
PORTD_CTPLS_POSITION                     equ 0000h
PORTD_CTPLS_SIZE                         equ 0001h
PORTD_CTPLS_LENGTH                       equ 0001h
PORTD_CTPLS_MASK                         equ 0001h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RE4_POSN                           equ 0004h
PORTE_RE4_POSITION                       equ 0004h
PORTE_RE4_SIZE                           equ 0001h
PORTE_RE4_LENGTH                         equ 0001h
PORTE_RE4_MASK                           equ 0010h
PORTE_RE5_POSN                           equ 0005h
PORTE_RE5_POSITION                       equ 0005h
PORTE_RE5_SIZE                           equ 0001h
PORTE_RE5_LENGTH                         equ 0001h
PORTE_RE5_MASK                           equ 0020h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h
PORTE_LCDBIAS1_POSN                      equ 0000h
PORTE_LCDBIAS1_POSITION                  equ 0000h
PORTE_LCDBIAS1_SIZE                      equ 0001h
PORTE_LCDBIAS1_LENGTH                    equ 0001h
PORTE_LCDBIAS1_MASK                      equ 0001h
PORTE_LCDBIAS2_POSN                      equ 0001h
PORTE_LCDBIAS2_POSITION                  equ 0001h
PORTE_LCDBIAS2_SIZE                      equ 0001h
PORTE_LCDBIAS2_LENGTH                    equ 0001h
PORTE_LCDBIAS2_MASK                      equ 0002h
PORTE_COM0_POSN                          equ 0003h
PORTE_COM0_POSITION                      equ 0003h
PORTE_COM0_SIZE                          equ 0001h
PORTE_COM0_LENGTH                        equ 0001h
PORTE_COM0_MASK                          equ 0008h
PORTE_COM1_POSN                          equ 0004h
PORTE_COM1_POSITION                      equ 0004h
PORTE_COM1_SIZE                          equ 0001h
PORTE_COM1_LENGTH                        equ 0001h
PORTE_COM1_MASK                          equ 0010h
PORTE_COM2_POSN                          equ 0005h
PORTE_COM2_POSITION                      equ 0005h
PORTE_COM2_SIZE                          equ 0001h
PORTE_COM2_LENGTH                        equ 0001h
PORTE_COM2_MASK                          equ 0020h
PORTE_COM3_POSN                          equ 0006h
PORTE_COM3_POSITION                      equ 0006h
PORTE_COM3_SIZE                          equ 0001h
PORTE_COM3_LENGTH                        equ 0001h
PORTE_COM3_MASK                          equ 0040h
PORTE_CCP2_POSN                          equ 0007h
PORTE_CCP2_POSITION                      equ 0007h
PORTE_CCP2_SIZE                          equ 0001h
PORTE_CCP2_LENGTH                        equ 0001h
PORTE_CCP2_MASK                          equ 0080h
PORTE_SEG31_POSN                         equ 0007h
PORTE_SEG31_POSITION                     equ 0007h
PORTE_SEG31_SIZE                         equ 0001h
PORTE_SEG31_LENGTH                       equ 0001h
PORTE_SEG31_MASK                         equ 0080h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_CCP8E_POSN                         equ 0004h
PORTE_CCP8E_POSITION                     equ 0004h
PORTE_CCP8E_SIZE                         equ 0001h
PORTE_CCP8E_LENGTH                       equ 0001h
PORTE_CCP8E_MASK                         equ 0010h
PORTE_CCP7E_POSN                         equ 0005h
PORTE_CCP7E_POSITION                     equ 0005h
PORTE_CCP7E_SIZE                         equ 0001h
PORTE_CCP7E_LENGTH                       equ 0001h
PORTE_CCP7E_MASK                         equ 0020h
PORTE_CCP6E_POSN                         equ 0006h
PORTE_CCP6E_POSITION                     equ 0006h
PORTE_CCP6E_SIZE                         equ 0001h
PORTE_CCP6E_LENGTH                       equ 0001h
PORTE_CCP6E_MASK                         equ 0040h
PORTE_CCP2E_POSN                         equ 0007h
PORTE_CCP2E_POSITION                     equ 0007h
PORTE_CCP2E_SIZE                         equ 0001h
PORTE_CCP2E_LENGTH                       equ 0001h
PORTE_CCP2E_MASK                         equ 0080h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h
PORTE_PB3E_POSN                          equ 0004h
PORTE_PB3E_POSITION                      equ 0004h
PORTE_PB3E_SIZE                          equ 0001h
PORTE_PB3E_LENGTH                        equ 0001h
PORTE_PB3E_MASK                          equ 0010h
PORTE_PC1E_POSN                          equ 0005h
PORTE_PC1E_POSITION                      equ 0005h
PORTE_PC1E_SIZE                          equ 0001h
PORTE_PC1E_LENGTH                        equ 0001h
PORTE_PC1E_MASK                          equ 0020h
PORTE_PB1E_POSN                          equ 0006h
PORTE_PB1E_POSITION                      equ 0006h
PORTE_PB1E_SIZE                          equ 0001h
PORTE_PB1E_LENGTH                        equ 0001h
PORTE_PB1E_MASK                          equ 0040h
PORTE_PA2E_POSN                          equ 0007h
PORTE_PA2E_POSITION                      equ 0007h
PORTE_PA2E_SIZE                          equ 0001h
PORTE_PA2E_LENGTH                        equ 0001h
PORTE_PA2E_MASK                          equ 0080h

