GopalSaraf/Practicals/PSDL/include/proc/pic18f66j93.inc
// Register: LCDSE4
#define LCDSE4 LCDSE4
LCDSE4                                   equ 0FB9h
// bitfield definitions
LCDSE4_LCDSE4_POSN                       equ 0000h
LCDSE4_LCDSE4_POSITION                   equ 0000h
LCDSE4_LCDSE4_SIZE                       equ 0008h
LCDSE4_LCDSE4_LENGTH                     equ 0008h
LCDSE4_LCDSE4_MASK                       equ 00FFh
LCDSE4_SE32_POSN                         equ 0000h
LCDSE4_SE32_POSITION                     equ 0000h
LCDSE4_SE32_SIZE                         equ 0001h
LCDSE4_SE32_LENGTH                       equ 0001h
LCDSE4_SE32_MASK                         equ 0001h
LCDSE4_SEGEN32_POSN                      equ 0000h
LCDSE4_SEGEN32_POSITION                  equ 0000h
LCDSE4_SEGEN32_SIZE                      equ 0001h
LCDSE4_SEGEN32_LENGTH                    equ 0001h
LCDSE4_SEGEN32_MASK                      equ 0001h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 0FBBh
// bitfield definitions
LCDDATA0_LCDDATA0_POSN                   equ 0000h
LCDDATA0_LCDDATA0_POSITION               equ 0000h
LCDDATA0_LCDDATA0_SIZE                   equ 0008h
LCDDATA0_LCDDATA0_LENGTH                 equ 0008h
LCDDATA0_LCDDATA0_MASK                   equ 00FFh
LCDDATA0_S0C0_POSN                       equ 0000h
LCDDATA0_S0C0_POSITION                   equ 0000h
LCDDATA0_S0C0_SIZE                       equ 0001h
LCDDATA0_S0C0_LENGTH                     equ 0001h
LCDDATA0_S0C0_MASK                       equ 0001h
LCDDATA0_S1C0_POSN                       equ 0001h
LCDDATA0_S1C0_POSITION                   equ 0001h
LCDDATA0_S1C0_SIZE                       equ 0001h
LCDDATA0_S1C0_LENGTH                     equ 0001h
LCDDATA0_S1C0_MASK                       equ 0002h
LCDDATA0_S2C0_POSN                       equ 0002h
LCDDATA0_S2C0_POSITION                   equ 0002h
LCDDATA0_S2C0_SIZE                       equ 0001h
LCDDATA0_S2C0_LENGTH                     equ 0001h
LCDDATA0_S2C0_MASK                       equ 0004h
LCDDATA0_S3C0_POSN                       equ 0003h
LCDDATA0_S3C0_POSITION                   equ 0003h
LCDDATA0_S3C0_SIZE                       equ 0001h
LCDDATA0_S3C0_LENGTH                     equ 0001h
LCDDATA0_S3C0_MASK                       equ 0008h
LCDDATA0_S4C0_POSN                       equ 0004h
LCDDATA0_S4C0_POSITION                   equ 0004h
LCDDATA0_S4C0_SIZE                       equ 0001h
LCDDATA0_S4C0_LENGTH                     equ 0001h
LCDDATA0_S4C0_MASK                       equ 0010h
LCDDATA0_S5C0_POSN                       equ 0005h
LCDDATA0_S5C0_POSITION                   equ 0005h
LCDDATA0_S5C0_SIZE                       equ 0001h
LCDDATA0_S5C0_LENGTH                     equ 0001h
LCDDATA0_S5C0_MASK                       equ 0020h
LCDDATA0_S6C0_POSN                       equ 0006h
LCDDATA0_S6C0_POSITION                   equ 0006h
LCDDATA0_S6C0_SIZE                       equ 0001h
LCDDATA0_S6C0_LENGTH                     equ 0001h
LCDDATA0_S6C0_MASK                       equ 0040h
LCDDATA0_S7C0_POSN                       equ 0007h
LCDDATA0_S7C0_POSITION                   equ 0007h
LCDDATA0_S7C0_SIZE                       equ 0001h
LCDDATA0_S7C0_LENGTH                     equ 0001h
LCDDATA0_S7C0_MASK                       equ 0080h
LCDDATA0_SEG0COM0_POSN                   equ 0000h
LCDDATA0_SEG0COM0_POSITION               equ 0000h
LCDDATA0_SEG0COM0_SIZE                   equ 0001h
LCDDATA0_SEG0COM0_LENGTH                 equ 0001h
LCDDATA0_SEG0COM0_MASK                   equ 0001h
LCDDATA0_SEG1COM0_POSN                   equ 0001h
LCDDATA0_SEG1COM0_POSITION               equ 0001h
LCDDATA0_SEG1COM0_SIZE                   equ 0001h
LCDDATA0_SEG1COM0_LENGTH                 equ 0001h
LCDDATA0_SEG1COM0_MASK                   equ 0002h
LCDDATA0_SEG2COM0_POSN                   equ 0002h
LCDDATA0_SEG2COM0_POSITION               equ 0002h
LCDDATA0_SEG2COM0_SIZE                   equ 0001h
LCDDATA0_SEG2COM0_LENGTH                 equ 0001h
LCDDATA0_SEG2COM0_MASK                   equ 0004h
LCDDATA0_SEG3COM0_POSN                   equ 0003h
LCDDATA0_SEG3COM0_POSITION               equ 0003h
LCDDATA0_SEG3COM0_SIZE                   equ 0001h
LCDDATA0_SEG3COM0_LENGTH                 equ 0001h
LCDDATA0_SEG3COM0_MASK                   equ 0008h
LCDDATA0_SEG4COM0_POSN                   equ 0004h
LCDDATA0_SEG4COM0_POSITION               equ 0004h
LCDDATA0_SEG4COM0_SIZE                   equ 0001h
LCDDATA0_SEG4COM0_LENGTH                 equ 0001h
LCDDATA0_SEG4COM0_MASK                   equ 0010h
LCDDATA0_SEG5COM0_POSN                   equ 0005h
LCDDATA0_SEG5COM0_POSITION               equ 0005h
LCDDATA0_SEG5COM0_SIZE                   equ 0001h
LCDDATA0_SEG5COM0_LENGTH                 equ 0001h
LCDDATA0_SEG5COM0_MASK                   equ 0020h
LCDDATA0_SEG6COM0_POSN                   equ 0006h
LCDDATA0_SEG6COM0_POSITION               equ 0006h
LCDDATA0_SEG6COM0_SIZE                   equ 0001h
LCDDATA0_SEG6COM0_LENGTH                 equ 0001h
LCDDATA0_SEG6COM0_MASK                   equ 0040h
LCDDATA0_SEG7COM0_POSN                   equ 0007h
LCDDATA0_SEG7COM0_POSITION               equ 0007h
LCDDATA0_SEG7COM0_SIZE                   equ 0001h
LCDDATA0_SEG7COM0_LENGTH                 equ 0001h
LCDDATA0_SEG7COM0_MASK                   equ 0080h
LCDDATA0_S00C0_POSN                      equ 0000h
LCDDATA0_S00C0_POSITION                  equ 0000h
LCDDATA0_S00C0_SIZE                      equ 0001h
LCDDATA0_S00C0_LENGTH                    equ 0001h
LCDDATA0_S00C0_MASK                      equ 0001h
LCDDATA0_S01C0_POSN                      equ 0001h
LCDDATA0_S01C0_POSITION                  equ 0001h
LCDDATA0_S01C0_SIZE                      equ 0001h
LCDDATA0_S01C0_LENGTH                    equ 0001h
LCDDATA0_S01C0_MASK                      equ 0002h
LCDDATA0_S02C0_POSN                      equ 0002h
LCDDATA0_S02C0_POSITION                  equ 0002h
LCDDATA0_S02C0_SIZE                      equ 0001h
LCDDATA0_S02C0_LENGTH                    equ 0001h
LCDDATA0_S02C0_MASK                      equ 0004h
LCDDATA0_S03C0_POSN                      equ 0003h
LCDDATA0_S03C0_POSITION                  equ 0003h
LCDDATA0_S03C0_SIZE                      equ 0001h
LCDDATA0_S03C0_LENGTH                    equ 0001h
LCDDATA0_S03C0_MASK                      equ 0008h
LCDDATA0_S04C0_POSN                      equ 0004h
LCDDATA0_S04C0_POSITION                  equ 0004h
LCDDATA0_S04C0_SIZE                      equ 0001h
LCDDATA0_S04C0_LENGTH                    equ 0001h
LCDDATA0_S04C0_MASK                      equ 0010h
LCDDATA0_S05C0_POSN                      equ 0005h
LCDDATA0_S05C0_POSITION                  equ 0005h
LCDDATA0_S05C0_SIZE                      equ 0001h
LCDDATA0_S05C0_LENGTH                    equ 0001h
LCDDATA0_S05C0_MASK                      equ 0020h
LCDDATA0_S06C0_POSN                      equ 0006h
LCDDATA0_S06C0_POSITION                  equ 0006h
LCDDATA0_S06C0_SIZE                      equ 0001h
LCDDATA0_S06C0_LENGTH                    equ 0001h
LCDDATA0_S06C0_MASK                      equ 0040h
LCDDATA0_S07C0_POSN                      equ 0007h
LCDDATA0_S07C0_POSITION                  equ 0007h
LCDDATA0_S07C0_SIZE                      equ 0001h
LCDDATA0_S07C0_LENGTH                    equ 0001h
LCDDATA0_S07C0_MASK                      equ 0080h

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
LCDDATA1                                 equ 0FBCh
// bitfield definitions
LCDDATA1_LCDDATA1_POSN                   equ 0000h
LCDDATA1_LCDDATA1_POSITION               equ 0000h
LCDDATA1_LCDDATA1_SIZE                   equ 0008h
LCDDATA1_LCDDATA1_LENGTH                 equ 0008h
LCDDATA1_LCDDATA1_MASK                   equ 00FFh
LCDDATA1_S8C0_POSN                       equ 0000h
LCDDATA1_S8C0_POSITION                   equ 0000h
LCDDATA1_S8C0_SIZE                       equ 0001h
LCDDATA1_S8C0_LENGTH                     equ 0001h
LCDDATA1_S8C0_MASK                       equ 0001h
LCDDATA1_S9C0_POSN                       equ 0001h
LCDDATA1_S9C0_POSITION                   equ 0001h
LCDDATA1_S9C0_SIZE                       equ 0001h
LCDDATA1_S9C0_LENGTH                     equ 0001h
LCDDATA1_S9C0_MASK                       equ 0002h
LCDDATA1_S10C0_POSN                      equ 0002h
LCDDATA1_S10C0_POSITION                  equ 0002h
LCDDATA1_S10C0_SIZE                      equ 0001h
LCDDATA1_S10C0_LENGTH                    equ 0001h
LCDDATA1_S10C0_MASK                      equ 0004h
LCDDATA1_S11C0_POSN                      equ 0003h
LCDDATA1_S11C0_POSITION                  equ 0003h
LCDDATA1_S11C0_SIZE                      equ 0001h
LCDDATA1_S11C0_LENGTH                    equ 0001h
LCDDATA1_S11C0_MASK                      equ 0008h
LCDDATA1_S12C0_POSN                      equ 0004h
LCDDATA1_S12C0_POSITION                  equ 0004h
LCDDATA1_S12C0_SIZE                      equ 0001h
LCDDATA1_S12C0_LENGTH                    equ 0001h
LCDDATA1_S12C0_MASK                      equ 0010h
LCDDATA1_S13C0_POSN                      equ 0005h
LCDDATA1_S13C0_POSITION                  equ 0005h
LCDDATA1_S13C0_SIZE                      equ 0001h
LCDDATA1_S13C0_LENGTH                    equ 0001h
LCDDATA1_S13C0_MASK                      equ 0020h
LCDDATA1_S14C0_POSN                      equ 0006h
LCDDATA1_S14C0_POSITION                  equ 0006h
LCDDATA1_S14C0_SIZE                      equ 0001h
LCDDATA1_S14C0_LENGTH                    equ 0001h
LCDDATA1_S14C0_MASK                      equ 0040h
LCDDATA1_S15C0_POSN                      equ 0007h
LCDDATA1_S15C0_POSITION                  equ 0007h
LCDDATA1_S15C0_SIZE                      equ 0001h
LCDDATA1_S15C0_LENGTH                    equ 0001h
LCDDATA1_S15C0_MASK                      equ 0080h
LCDDATA1_SEG8COM0_POSN                   equ 0000h
LCDDATA1_SEG8COM0_POSITION               equ 0000h
LCDDATA1_SEG8COM0_SIZE                   equ 0001h
LCDDATA1_SEG8COM0_LENGTH                 equ 0001h
LCDDATA1_SEG8COM0_MASK                   equ 0001h
LCDDATA1_SEG9COM0_POSN                   equ 0001h
LCDDATA1_SEG9COM0_POSITION               equ 0001h
LCDDATA1_SEG9COM0_SIZE                   equ 0001h
LCDDATA1_SEG9COM0_LENGTH                 equ 0001h
LCDDATA1_SEG9COM0_MASK                   equ 0002h
LCDDATA1_SEG10COM0_POSN                  equ 0002h
LCDDATA1_SEG10COM0_POSITION              equ 0002h
LCDDATA1_SEG10COM0_SIZE                  equ 0001h
LCDDATA1_SEG10COM0_LENGTH                equ 0001h
LCDDATA1_SEG10COM0_MASK                  equ 0004h
LCDDATA1_SEG11COM0_POSN                  equ 0003h
LCDDATA1_SEG11COM0_POSITION              equ 0003h
LCDDATA1_SEG11COM0_SIZE                  equ 0001h
LCDDATA1_SEG11COM0_LENGTH                equ 0001h
LCDDATA1_SEG11COM0_MASK                  equ 0008h
LCDDATA1_SEG12COM0_POSN                  equ 0004h
LCDDATA1_SEG12COM0_POSITION              equ 0004h
LCDDATA1_SEG12COM0_SIZE                  equ 0001h
LCDDATA1_SEG12COM0_LENGTH                equ 0001h
LCDDATA1_SEG12COM0_MASK                  equ 0010h
LCDDATA1_SEG13COM0_POSN                  equ 0005h
LCDDATA1_SEG13COM0_POSITION              equ 0005h
LCDDATA1_SEG13COM0_SIZE                  equ 0001h
LCDDATA1_SEG13COM0_LENGTH                equ 0001h
LCDDATA1_SEG13COM0_MASK                  equ 0020h
LCDDATA1_SEG14COM0_POSN                  equ 0006h
LCDDATA1_SEG14COM0_POSITION              equ 0006h
LCDDATA1_SEG14COM0_SIZE                  equ 0001h
LCDDATA1_SEG14COM0_LENGTH                equ 0001h
LCDDATA1_SEG14COM0_MASK                  equ 0040h
LCDDATA1_SEG15COM0_POSN                  equ 0007h
LCDDATA1_SEG15COM0_POSITION              equ 0007h
LCDDATA1_SEG15COM0_SIZE                  equ 0001h
LCDDATA1_SEG15COM0_LENGTH                equ 0001h
LCDDATA1_SEG15COM0_MASK                  equ 0080h
LCDDATA1_S08C0_POSN                      equ 0000h
LCDDATA1_S08C0_POSITION                  equ 0000h
LCDDATA1_S08C0_SIZE                      equ 0001h
LCDDATA1_S08C0_LENGTH                    equ 0001h
LCDDATA1_S08C0_MASK                      equ 0001h
LCDDATA1_S09C0_POSN                      equ 0001h
LCDDATA1_S09C0_POSITION                  equ 0001h
LCDDATA1_S09C0_SIZE                      equ 0001h
LCDDATA1_S09C0_LENGTH                    equ 0001h
LCDDATA1_S09C0_MASK                      equ 0002h

// Register: LCDDATA2
#define LCDDATA2 LCDDATA2
LCDDATA2                                 equ 0FBDh
// bitfield definitions
LCDDATA2_LCDDATA2_POSN                   equ 0000h
LCDDATA2_LCDDATA2_POSITION               equ 0000h
LCDDATA2_LCDDATA2_SIZE                   equ 0008h
LCDDATA2_LCDDATA2_LENGTH                 equ 0008h
LCDDATA2_LCDDATA2_MASK                   equ 00FFh
LCDDATA2_S16C0_POSN                      equ 0000h
LCDDATA2_S16C0_POSITION                  equ 0000h
LCDDATA2_S16C0_SIZE                      equ 0001h
LCDDATA2_S16C0_LENGTH                    equ 0001h
LCDDATA2_S16C0_MASK                      equ 0001h
LCDDATA2_S17C0_POSN                      equ 0001h
LCDDATA2_S17C0_POSITION                  equ 0001h
LCDDATA2_S17C0_SIZE                      equ 0001h
LCDDATA2_S17C0_LENGTH                    equ 0001h
LCDDATA2_S17C0_MASK                      equ 0002h
LCDDATA2_S18C0_POSN                      equ 0002h
LCDDATA2_S18C0_POSITION                  equ 0002h
LCDDATA2_S18C0_SIZE                      equ 0001h
LCDDATA2_S18C0_LENGTH                    equ 0001h
LCDDATA2_S18C0_MASK                      equ 0004h
LCDDATA2_S19C0_POSN                      equ 0003h
LCDDATA2_S19C0_POSITION                  equ 0003h
LCDDATA2_S19C0_SIZE                      equ 0001h
LCDDATA2_S19C0_LENGTH                    equ 0001h
LCDDATA2_S19C0_MASK                      equ 0008h
LCDDATA2_S20C0_POSN                      equ 0004h
LCDDATA2_S20C0_POSITION                  equ 0004h
LCDDATA2_S20C0_SIZE                      equ 0001h
LCDDATA2_S20C0_LENGTH                    equ 0001h
LCDDATA2_S20C0_MASK                      equ 0010h
LCDDATA2_S21C0_POSN                      equ 0005h
LCDDATA2_S21C0_POSITION                  equ 0005h
LCDDATA2_S21C0_SIZE                      equ 0001h
LCDDATA2_S21C0_LENGTH                    equ 0001h
LCDDATA2_S21C0_MASK                      equ 0020h
LCDDATA2_S22C0_POSN                      equ 0006h
LCDDATA2_S22C0_POSITION                  equ 0006h
LCDDATA2_S22C0_SIZE                      equ 0001h
LCDDATA2_S22C0_LENGTH                    equ 0001h
LCDDATA2_S22C0_MASK                      equ 0040h
LCDDATA2_S23C0_POSN                      equ 0007h
LCDDATA2_S23C0_POSITION                  equ 0007h
LCDDATA2_S23C0_SIZE                      equ 0001h
LCDDATA2_S23C0_LENGTH                    equ 0001h
LCDDATA2_S23C0_MASK                      equ 0080h
LCDDATA2_SEG16COM0_POSN                  equ 0000h
LCDDATA2_SEG16COM0_POSITION              equ 0000h
LCDDATA2_SEG16COM0_SIZE                  equ 0001h
LCDDATA2_SEG16COM0_LENGTH                equ 0001h
LCDDATA2_SEG16COM0_MASK                  equ 0001h
LCDDATA2_SEG17COM0_POSN                  equ 0001h
LCDDATA2_SEG17COM0_POSITION              equ 0001h
LCDDATA2_SEG17COM0_SIZE                  equ 0001h
LCDDATA2_SEG17COM0_LENGTH                equ 0001h
LCDDATA2_SEG17COM0_MASK                  equ 0002h
LCDDATA2_SEG18COM0_POSN                  equ 0002h
LCDDATA2_SEG18COM0_POSITION              equ 0002h
LCDDATA2_SEG18COM0_SIZE                  equ 0001h
LCDDATA2_SEG18COM0_LENGTH                equ 0001h
LCDDATA2_SEG18COM0_MASK                  equ 0004h
LCDDATA2_SEG19COM0_POSN                  equ 0003h
LCDDATA2_SEG19COM0_POSITION              equ 0003h
LCDDATA2_SEG19COM0_SIZE                  equ 0001h
LCDDATA2_SEG19COM0_LENGTH                equ 0001h
LCDDATA2_SEG19COM0_MASK                  equ 0008h
LCDDATA2_SEG20COM0_POSN                  equ 0004h
LCDDATA2_SEG20COM0_POSITION              equ 0004h
LCDDATA2_SEG20COM0_SIZE                  equ 0001h
LCDDATA2_SEG20COM0_LENGTH                equ 0001h
LCDDATA2_SEG20COM0_MASK                  equ 0010h
LCDDATA2_SEG21COM0_POSN                  equ 0005h
LCDDATA2_SEG21COM0_POSITION              equ 0005h
LCDDATA2_SEG21COM0_SIZE                  equ 0001h
LCDDATA2_SEG21COM0_LENGTH                equ 0001h
LCDDATA2_SEG21COM0_MASK                  equ 0020h
LCDDATA2_SEG22COM0_POSN                  equ 0006h
LCDDATA2_SEG22COM0_POSITION              equ 0006h
LCDDATA2_SEG22COM0_SIZE                  equ 0001h
LCDDATA2_SEG22COM0_LENGTH                equ 0001h
LCDDATA2_SEG22COM0_MASK                  equ 0040h
LCDDATA2_SEG23COM0_POSN                  equ 0007h
LCDDATA2_SEG23COM0_POSITION              equ 0007h
LCDDATA2_SEG23COM0_SIZE                  equ 0001h
LCDDATA2_SEG23COM0_LENGTH                equ 0001h
LCDDATA2_SEG23COM0_MASK                  equ 0080h

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 0FBEh
// bitfield definitions
LCDDATA3_LCDDATA3_POSN                   equ 0000h
LCDDATA3_LCDDATA3_POSITION               equ 0000h
LCDDATA3_LCDDATA3_SIZE                   equ 0008h
LCDDATA3_LCDDATA3_LENGTH                 equ 0008h
LCDDATA3_LCDDATA3_MASK                   equ 00FFh
LCDDATA3_S24C0_POSN                      equ 0000h
LCDDATA3_S24C0_POSITION                  equ 0000h
LCDDATA3_S24C0_SIZE                      equ 0001h
LCDDATA3_S24C0_LENGTH                    equ 0001h
LCDDATA3_S24C0_MASK                      equ 0001h
LCDDATA3_S25C0_POSN                      equ 0001h
LCDDATA3_S25C0_POSITION                  equ 0001h
LCDDATA3_S25C0_SIZE                      equ 0001h
LCDDATA3_S25C0_LENGTH                    equ 0001h
LCDDATA3_S25C0_MASK                      equ 0002h
LCDDATA3_S26C0_POSN                      equ 0002h
LCDDATA3_S26C0_POSITION                  equ 0002h
LCDDATA3_S26C0_SIZE                      equ 0001h
LCDDATA3_S26C0_LENGTH                    equ 0001h
LCDDATA3_S26C0_MASK                      equ 0004h
LCDDATA3_S27C0_POSN                      equ 0003h
LCDDATA3_S27C0_POSITION                  equ 0003h
LCDDATA3_S27C0_SIZE                      equ 0001h
LCDDATA3_S27C0_LENGTH                    equ 0001h
LCDDATA3_S27C0_MASK                      equ 0008h
LCDDATA3_S28C0_POSN                      equ 0004h
LCDDATA3_S28C0_POSITION                  equ 0004h
LCDDATA3_S28C0_SIZE                      equ 0001h
LCDDATA3_S28C0_LENGTH                    equ 0001h
LCDDATA3_S28C0_MASK                      equ 0010h
LCDDATA3_S29C0_POSN                      equ 0005h
LCDDATA3_S29C0_POSITION                  equ 0005h
LCDDATA3_S29C0_SIZE                      equ 0001h
LCDDATA3_S29C0_LENGTH                    equ 0001h
LCDDATA3_S29C0_MASK                      equ 0020h
LCDDATA3_S30C0_POSN                      equ 0006h
LCDDATA3_S30C0_POSITION                  equ 0006h
LCDDATA3_S30C0_SIZE                      equ 0001h
LCDDATA3_S30C0_LENGTH                    equ 0001h
LCDDATA3_S30C0_MASK                      equ 0040h
LCDDATA3_S31C0_POSN                      equ 0007h
LCDDATA3_S31C0_POSITION                  equ 0007h
LCDDATA3_S31C0_SIZE                      equ 0001h
LCDDATA3_S31C0_LENGTH                    equ 0001h
LCDDATA3_S31C0_MASK                      equ 0080h
LCDDATA3_SEG24COM0_POSN                  equ 0000h
LCDDATA3_SEG24COM0_POSITION              equ 0000h
LCDDATA3_SEG24COM0_SIZE                  equ 0001h
LCDDATA3_SEG24COM0_LENGTH                equ 0001h
LCDDATA3_SEG24COM0_MASK                  equ 0001h
LCDDATA3_SEG25COM0_POSN                  equ 0001h
LCDDATA3_SEG25COM0_POSITION              equ 0001h
LCDDATA3_SEG25COM0_SIZE                  equ 0001h
LCDDATA3_SEG25COM0_LENGTH                equ 0001h
LCDDATA3_SEG25COM0_MASK                  equ 0002h
LCDDATA3_SEG26COM0_POSN                  equ 0002h
LCDDATA3_SEG26COM0_POSITION              equ 0002h
LCDDATA3_SEG26COM0_SIZE                  equ 0001h
LCDDATA3_SEG26COM0_LENGTH                equ 0001h
LCDDATA3_SEG26COM0_MASK                  equ 0004h
LCDDATA3_SEG27COM0_POSN                  equ 0003h
LCDDATA3_SEG27COM0_POSITION              equ 0003h
LCDDATA3_SEG27COM0_SIZE                  equ 0001h
LCDDATA3_SEG27COM0_LENGTH                equ 0001h
LCDDATA3_SEG27COM0_MASK                  equ 0008h
LCDDATA3_SEG28COM0_POSN                  equ 0004h
LCDDATA3_SEG28COM0_POSITION              equ 0004h
LCDDATA3_SEG28COM0_SIZE                  equ 0001h
LCDDATA3_SEG28COM0_LENGTH                equ 0001h
LCDDATA3_SEG28COM0_MASK                  equ 0010h
LCDDATA3_SEG29COM0_POSN                  equ 0005h
LCDDATA3_SEG29COM0_POSITION              equ 0005h
LCDDATA3_SEG29COM0_SIZE                  equ 0001h
LCDDATA3_SEG29COM0_LENGTH                equ 0001h
LCDDATA3_SEG29COM0_MASK                  equ 0020h
LCDDATA3_SEG30COM0_POSN                  equ 0006h
LCDDATA3_SEG30COM0_POSITION              equ 0006h
LCDDATA3_SEG30COM0_SIZE                  equ 0001h
LCDDATA3_SEG30COM0_LENGTH                equ 0001h
LCDDATA3_SEG30COM0_MASK                  equ 0040h
LCDDATA3_SEG31COM0_POSN                  equ 0007h
LCDDATA3_SEG31COM0_POSITION              equ 0007h
LCDDATA3_SEG31COM0_SIZE                  equ 0001h
LCDDATA3_SEG31COM0_LENGTH                equ 0001h
LCDDATA3_SEG31COM0_MASK                  equ 0080h

